import React from 'react';
import styles from './page.module.css';
import Header from '../components/header/Header';

const posts = [
  {
    title: 'Georgian Airways -ს “ზიარი კოდების” ხელშეკრულება წამყვან ავიაკომპანიებთან აქვს',
    description: `გერმანულმა კომპანია Lufthansa -მ ავიაბილეთების ფასი გააძვირა. აღნიშნულის შესახებ ინფრომაციას თავად Lufthansa Group ავრცელებს. კომპანიის ცნობით, დამატებითი გადასახადის დაწესება კლიმატის მოთხოვნებთან შესაბამისობის გამო გაზრდილ ხარჯებს უკავშირდება.

    გაზრდილი ტარიფები შეეხება ევროკავშირის 27 წევრი ქვეყნიდან განხორციელებულ ფრენებს, ასევე, დიდი ბრიტანეთიდან, ნორვეგიიდან და შვეიცარიიდან შესრულებულ რეისებს.
    კომპანიის განცხადებით, ავიაბილეთებზე ფასები 72 ევრომდე გაიზრდება, აღნიშნული დამოკიდებულია მიმართულებაზე და გარემოსდაცვით ტარიფებზე.`,
    date: 'June 25, 2024',
    link: '#',
    imageName: 'georgianAirways.jpg',
  },
  {
    title: 'Lufthansa Safety Measures',
    description: `ქართულ ავიაკომპანია Georgian Airways -ს მსოფლიოს უმსხვილესი ავიაკომპანიების ავიაბილეთების რეალიზაცია შეუძლია. Georgian Airways-ს ზიარი კოდების (Codeshare agreement) გამოყენებაზე ხელშეკრულებები ისეთ მსხვილ ავიაკომპანიებთან გააჩნია, როგორებიცაა: Air France , Austrian Airlines , Air Astana , KLM , Delta Airlines და სხვა. აღნიშნული ხელშეკრულებებით, ამავე ავიაკომპანიებს ასევე შეუძლიათ გაყიდონ კომბინირებული ბილეთები Georgian Airways-ს მიმართულებებზე.

    ჯეორჯიან ეარვეისი -ს ვებგვერდზე განთავსებული ინფორმაციის მიხედვით, ავიაკომპანიის ერთ-ერთ ძირითად პრიორიტეტს, მსოფლიოს წამყვან ავიაკომპანიებთან პარტნიორული ურთიერთობების დამყარება წარმოადგენს. ამ დროისათვის georgian airways -ს ინტერლაინ ხელშეკრულებები რამდენიმე მსხვილ ავიაკომპანიასთან აქვს დადებული.`,
    date: 'June 20, 2024',
    link: '#',
    imageName: 'lufthansa.jpg',
  },
  {
    title: 'Turkish Airlines -მა უკვე მეცხრედ მოიპოვა “ევროპის საუკეთესო ავიაკომპანიის“ სტატუსი',
    description: `თურქეთის ეროვნულ ავიაკომპანია Turkish Airlines -ს უკვე მეცხრედ მიანიჭეს “ევროპის საუკეთესო ავიაკომპანიის” ტიტული. ამის შესახებ თურქული ავიაკომპანიის პრესსამსახურის განცხადებაშია ნათქვამი. აღნიშნული გადაწყვეტილება საერთაშორისო ორგანიზაცია Skytrax -მა მიიღო, რომელიც საჰაერო ტრანსპორტის მომსახურების ხარისხის შეფასებაზეა სპეციალიზირებული.

    თურქეთის ავიახაზებმა მიიღო ჯილდოები შემდეგ კატეგორიებში: „მსოფლიოში საუკეთესო ბიზნეს კლასის კვების სერვისები“ და „საუკეთესო ავიაკომპანია სამხრეთ ევროპაში“.
    Skytrax -ის გადაწყვეტილებას, ავიაკომპანიის აღმასრულებელმა დირექტორმა ბილალ ეკშიმ, თურქეთის წამყვანი ავიაკომპანიის მთელი პერსონალის შრომისმოყვარეობის შედეგი უწოდა.`,
    date: 'June 18, 2024',
    link: '#',
    imageName: 'turkishAirlines.jpg',
  },
  {
    title: 'ავიაკომპანია Georgian Wings -მა ბოდრუმის მიმართულებით ჩარტერული ფრენები დაიწყო',
    description: `Georgian Wings -მა თბილისი -დან თურქეთის ქალაქ ბოდრუმის მიმართულებით პირველი საინაუგურაციო ფრენა შეასრულა. ავიაკომპანიის ცნობით, პირდაპირი ჩარტერული ფრენები ყოველ ოთხშაბათს, კვირაში ერთი სიხშირით შესრულდება. მგზავრებს 148 ადამიანზე გათვლილი Boeing 737-ით მოემსახურება.

    პირდაპირი ფრენის ხანგრძლივობა თბილისი ბოდრუმი ბოდრუმი თბილისი -ს საჰაერო ხაზზე 2 სთ და 50 წთ-ია. თბილისიდან რეისი 12:00 -ზე მიემგზავრება და ბოდრუმში თურქეთის დროით 13:50 -ზე ჩაფრინდება. ხოლო ბოდრუმიდან კი 14:50 -ზე გამოფრინდებდა და თბილისის აეროპორტში 18:25 -ზე ჩამოფრინდება.`,
    date: 'June 15, 2024',
    link: '#',
    imageName: 'georgianWings.jpg',
  },
];

const Airlines = () => {
  return (
    <div>
      <Header />
      <div className={styles.container}>
        <h1 className={styles.pageTitle}>Airlines Blog</h1>
        <div className={styles.posts}>
          {posts.map((post, index) => (
            <div key={index} className={styles.post}>
              <img
                src={`/images/${post.imageName}`}
                alt={post.title}
                className={styles.postImage}
              />
              <div className={styles.postContent}>
                <h2 className={styles.postTitle}>{post.title}</h2>
                <p className={styles.postDescription}>{post.description}</p>
                <span className={styles.date}>{post.date}</span>
              </div>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
};

export default Airlines;